<?php
/**
 * 参数配置文件
 *
 * @author weibaqiu
 * @date 2015-09-07
 */
return array(
    'cookieprefix' => 'house_',

    //css\js等静态资源路径
    'adminStaticPath' => '/static/admin/',
    'vipStaticPath' => '/static/vip/',
    'wapStaticPath' => '/static/wap/',
    'globalStaticPath' => '/static/global/',

    //总后台API
    'logApi' => 'api/log/',                     //日志api
    'bbsLoginApi' => 'api/bbs/login',           //前台登录
    'bbsGetuserinfoApi' => 'api/bbs/getuserinfo',           //前台登录
    'bbsLogoutApi' => 'api/bbs/logout',         //前台登录
    'smsApi' => 'api/mobile/sendMessage',       //短信发送接口
    'siteConfigApi' => array(                   //全站配置接口
        'list' => 'api/siteConfig/list/',
        'view' => 'api/siteConfig/view/',
        'create' => '',
        'update' => '',
        'delete' => '',
    ),
    'userApi' => array(                     //用户信息接口
        'list' => 'api/user/list/',
        'view' => 'api/user/view/',
        'create' => '',
        'update' => '',
        'delete' => '',
    ),
    //信息来源(包括resoldzf,resoldesf)
    'source' => array(
        '1' => '个人',
        '2' => '中介',
        '3' => '后台'
    ),
    //审核状态(二手房和租房共用)
    'checkStatus' => [
        '0' => '未审核',
        '1' => '正常',
        '2' => '审核中',
        '3' => '未通过'
    ],
    //销售状态(二手房和租房共用)
    'saleStatus' => [
        '1' => '上架',
        '2' => '下架',
        '3' => '回收'
    ],
    //电话确认
    'contacted' => [
        '0' => '否',
        '1' => '是'
    ],
    //房源分类
    'category' => [
        1 => '住房',
        2 => '商铺',
        3 => '写字楼'
    ],
    //房源分类
    'categoryPinyin' => [
        1 => 'zhuzhai',
        2 => 'shangpu',
        3 => 'xiezilou'
    ],
    //二手房求购状态
    'qgStatus' => [
        '0' => '未审核',
        '1' => '正常',
        '2' => '审核中',
        '3' => '未通过'
    ],
    //二手房求购状态
    'qzStatus' => [
        '0' => '未审核',
        '1' => '正常',
        '2' => '审核中',
        '3' => '未通过'
    ],
    //店铺状态
    'shopStatus' => [
        0 => '未审核',
        1 => '正常',
        2 => '禁用',
    ],
    //求租期望户型
    'qiuzufangtype' => [
        1 => '一居',
        2 => '二居',
        3 => '三居',
        4 => '四居',
        5 => '五居',
        6 => '五居以上'
    ],
    //房源举报处理状态
    'deal' => [
        0 => '未处理',
        1 => '已处理'
    ],
    //举报的房源类型
    'report_type' => [
        1 => '二手房',
        2 => '租房',
    ],
    //举报的链接
    'report_url' => [
        1 => '/resoldhome/esf/info',
        2 => '/resoldhome/zf/info',
    ],
    //判断二手房租房
    'esf_or_zf' => [
        1=> '二手房',
        2=>'租房'
    ],
    // 新房知识库标签分类
    'baikeTagCate'=> [
        0 => '新房',
        1 => '二手房',
        2 => '租房'
    ],
    // 二手房导航配置
    'resoldNav'=> [
        '首页',
        '二手房'=>[
            '在售房源',
            '个人房源',
            '邻校房',
            '找小区',
            '找经纪人',
            '求购',
            '我要卖房',
        ],
        '租房'=>[
            '个人租房',
            '整租房源',
            '合租房源',
            '求租',
            '我要出租',
        ],
        '写字楼'=>[
            '写字楼出售',
            '写字楼出租',
            '写字楼求购',
            '写字楼求租',
        ],
        '商铺'=>[
            '商铺出售',
            '商铺出租',
            '商铺求购',
            '商铺求租',
        ]
    ],
    // 楼盘属性
    'plotAttr'=>[
        'pinyin'=>'拼音',
        'sale_status'=>'销售状态',
        'open_time'=>'开盘时间',
        'delivery_time'=>'交房时间',
        'address'=>'楼盘地址',
        'sale_addr'=>'售楼地址',
        'sale_tel'=>'售楼电话',
        'map_lng'=>'经度',
        'map_lat'=>'纬度',
        'map_zoom'=>'缩放',
        'image'=>'封面',
        'price'=>'价格',
        'buildsize'=>'建筑面积',
        'size'=>'占地面积',
        'capacity'=>'容积率',
        'green'=>'绿化率',
        'manage_fee'=>'物业费',
        'manage_company'=>'物业公司',
        'developer'=>'开发商',
        'transit'=>'交通状况',
        'content'=>'项目简介',
        'peripheral'=>'项目配套',
        'wylx'=>'物业类别',
        'jzlb'=>'建筑类别',
        'xmts'=>'项目特色',
        'zxzt'=>'装修状况',
        'property_years'=>'产权年限',
        'household_num'=>'总户数',
        'building_num'=>'楼栋总数',
        'floor_desc'=>'楼层状况',
    ],
    'area'=>[
        '青浦'=>2,
        '松江'=>3,
        '浦东'=>7,
        '嘉定'=>8,
        '宝山'=>9,
        '闵行'=>10,
        '普陀'=>11,
        '徐汇'=>12,
        '杨浦'=>13,
        '虹口'=>14,
        '奉贤'=>15,
        '金山'=>16,
        '黄浦'=>17,
        '静安'=>18,
        '卢湾'=>19,
        '长宁'=>20,
        '崇明'=>21,
        '周边地区'=>22,
        '秀洲区'=>5,
        '南湖区'=>6,
        '嘉善县'=>23,
        '平湖市'=>24,
        '海宁市'=>25,
        '海盐县'=>26,
        '桐乡市'=>27,
        '建德市'=>70,
        '上城区'=>59,
        '下城区'=>60,
        '江干区'=>61,
        '拱墅区'=>62,
        '西湖区'=>63,
        '滨江区'=>64,
        '萧山区'=>65,
        '余杭区'=>66,
        '富阳区'=>67,
        '桐庐县'=>68,
        '淳安县'=>69,
        '临安市'=>71,
        '南浔区'=>36,
        '市中心'=>29,
        '南太湖'=>30,
        '凤凰开发区'=>31,
        '仁皇山新区'=>32,
        '吴兴区'=>33,
        '安吉县'=>34,
        '德清县'=>35,
        '长兴县'=>83,
        '崇川'=>38,
        '港闸'=>39,
        '通州'=>41,
        '开发区'=>40,
        '海门市'=>42,
        '海安县'=>43,
        '启东市'=>44,
        '如皋市'=>45,
        '如东县'=>46,
        '园区'=>48,
        '吴中'=>49,
        '姑苏'=>50,
        '相城'=>51,
        '新区'=>52,
        '吴江'=>53,
        '太仓'=>54,
        '张家港'=>55,
        '苏州周边'=>56,
        '玉山'=>73,
        '花桥'=>74,
        '陆家'=>75,
        '巴城'=>76,
        '张浦'=>77,
        '周市'=>78,
        '千灯'=>79,
        '淀山湖'=>80,
        '周庄'=>81,
        '锦溪'=>82,
        '上海'=>1,
        '嘉兴'=>4,
        '杭州'=>57,
        '湖州'=>28,
        '南通'=>37,
        '苏州'=>47,
        '昆山'=>72,
    ],

    'jzlb'=>[
        '多层'=>25,
        '高层'=>27,
        '别墅'=>38,
        '花园洋房'=>33,
        '大平层'=>35,
        '酒店式公寓'=>36,
        '商铺'=>37,
        '写字楼'=>34,
        '联排'=>32,
        '双拼'=>31,
        '独栋别墅'=>29,
        '叠拼'=>30,
    ],

    'zxzt'=>[
        '毛坯'=>5,
        '精装'=>7,
    ],

    'xmts'=>[
        '现房'=>62,
        '不限购不限贷'=>59,
        '小户型'=>56,
        '低总价'=>60,
        '临近学校'=>58,
        '品牌开发商'=>57,
        '豪华居住区'=>53,
        '高回报率'=>63,
        '宜居生态地产'=>50,
        '科技住宅'=>55,
        '国际化社区'=>51,
        '投资地产'=>72,
        '地铁沿线'=>69,
        '低密居所'=>68,
        '养老地产'=>73,
        '商业产权别墅'=>52,
        '湖景地产'=>64,
        '旅游地产'=>66,
        '景观居所'=>54,
        '配套商品房'=>65,
        '经济住宅'=>67,
        '复合地产'=>70,
        '公园地产'=>71,
        '南北通透'=>74,
    ],

    'wylx'=>[
        '住宅'=>48,
        '别墅'=>47,
        '酒店式公寓'=>42,
        '写字楼'=>46,
        '商铺'=>45,
        '花园洋房'=>43,
        '大平层'=>41,
        '两限房'=>44,
        '跃层住宅'=>40,
        '经济适用房'=>49,
        '复式挑高'=>39,
    ],

    'xszt'=>[
        '售罄'=>4,
        '尾盘'=>3,
        '在售'=>2,
        '待售'=>1,
    ],
    'imageTag'=>[
    '效果图'=>18,
    '样板间'=>17,
    '实景图'=>19,
    '沙盘图'=>23,
    '工程进度'=>22,
    '活动图'=>21,
    '交通图'=>20,
    '配套图'=>15,
    '项目现场'=>16,
    ],
);